tap "michaeleisel/zld"
tap "nikitabobko/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Google's own build tool
brew "bazel"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Post-modern modal text editor
brew "helix"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Postgres C API library
brew "libpq", link: true
# Next-gen compiler infrastructure
brew "llvm"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql"
# Development kit for the Java programming language
brew "openjdk@11"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Object-relational database system
brew "postgresql@14", link: false
# Object-relational database system
brew "postgresql@15"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-shell prompt for astronauts
brew "starship"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
cargo "cargo-expand"
cargo "cargo-nextest"
cargo "cargo-raze"
cargo "cargo-shuttle"
cargo "cargo-watch"
cargo "diesel_cli"
cargo "mdbook"
cargo "ripgrep"
cargo "typeshare-cli"
