tap "michaeleisel/zld"
tap "nikitabobko/tap"
# ANSI HTML adapter
brew "aha"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Post-modern modal text editor
brew "helix"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Postgres C API library
brew "libpq", link: true
# Next-gen compiler infrastructure
brew "llvm"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
